PKS1C/src/InformationRegisters/ПользователиБотаTelegram/ПользователиБотаTelegram.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПользователиБотаTelegram</name>
  <resources>
    <name>is_bot</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>first_name</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>last_name</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>username</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ФизическоеЛицо</name>
    <comment>сотрудник или клиент</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>UserID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/InformationRegisters/ПользователиБотаTelegram/ManagerModule.bsl
// Возвращает зарегистрированное в Telegram физ.лицо по соответствию UserID
// 
// Параметры:
//  UserID - Число - UserID аккаунта Telegram
// 
// Возвращаемое значение:
//  СправочникСсылка.ФизическиеЛица - Физ.лицо
Функция ФизЛицоПоUserID(UserID) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПользователиБотаTelegram.ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.ПользователиБотаTelegram КАК ПользователиБотаTelegram
		|ГДЕ
		|	ПользователиБотаTelegram.UserID = &UserID";
	
	Запрос.УстановитьПараметр("UserID", UserID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ФизЛицо = ВыборкаДетальныеЗаписи.ФизическоеЛицо;	
	КонецЕсли;
	
	Возврат ФизЛицо;
КонецФункции

// Возвращает зарегистрированного в Telegram пользователя ИББ по соответствию UserID
// 
// Параметры:
//  UserID - Число - UserID аккаунта Telegram
// 
// Возвращаемое значение:
//  СправочникСсылка.Пользователи - Пользователь
Функция ПользовательПоUserID(UserID) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПользователиБотаTelegram.Пользователь
		|ИЗ
		|	РегистрСведений.ПользователиБотаTelegram КАК ПользователиБотаTelegram
		|ГДЕ
		|	ПользователиБотаTelegram.UserID = &UserID";
	
	Запрос.УстановитьПараметр("UserID", UserID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Пользователь = ВыборкаДетальныеЗаписи.Пользователь;	
	КонецЕсли;
	
	Возврат Пользователь;
КонецФункции
